-- 测试用的数据
insert into Tips(date, type, content)
values ('2000-01-01 01:20:22', '娱乐', '<p>按照本集内容，《POP SQUAD》翻译为灭杀小组，灭绝小组或根除小组
这类含义相近的词组都是恰当的。自然，为了接下来的论述，不可避免地要对本集内容进行全然的剧透。
若是已看过本集，或是不介意剧透的读者，烦请继续听过牢骚。</p>
<p>《灭绝小组》的故事很简单，甚至在许多情节的设置上呈现出照本宣科式的陈腐：
在未来的某个时刻，凭借名叫“焕生治疗(rejoo treatment)”的科技，
人类实现了永生。或者是因为资源管理的需要，又或者纯粹是统治阶级的恶趣味，
永生的人类社会制定了一条抛却了诸多道德伦理的严苛法律：严禁任何人私自生育
哺养下一代，只有当有人放弃生命，让出位置，才能有新生儿被允许填补前人死亡后腾出来的空缺。</p>
<p>那么，在规定之外出生的胎儿该如何处置？回到本集标题《灭绝小组》，
警察部门成立了特化暴力机构，对所有许可之外的新生儿进行合法合规的制度化灭杀。</p'),
       ('2000-01-01 11:20:22', '知识', '测试内容'),
       ('2000-01-01 12:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2000-01-01 13:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2000-01-01 14:20:22', '娱乐', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2000-01-01 15:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2000-01-01 16:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2000-01-01 17:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-01 18:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-01 19:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-01 20:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-01 21:20:22', '娱乐', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-01 22:20:22', '娱乐', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-01 23:20:22', '娱乐', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-02 01:20:22', '娱乐', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-02 11:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-02 12:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-02 13:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2010-01-02 14:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2020-01-02 15:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2020-01-02 16:20:22', '娱乐', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2020-01-02 17:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2020-01-02 18:20:22', '娱乐', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2021-01-01 19:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2021-01-01 20:20:22', '娱乐', '我好想做嘉然小姐的狗啊'),
       ('2021-01-01 20:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi'),
       ('2021-01-01 21:20:22', '知识', '测试内容塔顶ffasdflkasfl!ksdf!lksdjfa^lkdjfa^ldf*&*(fasdioi');

insert into Comments(content, date, tips_id)
values ('不错,还挺有意思。', '2010-01-01 11:13:14', 1),
       ('不错,还挺有意思。', '2010-01-01 12:13:14', 1),
       ('不错,还挺有意思。', '2010-01-01 13:13:14', 1),
       ('不错,还挺有意思。', '2010-01-01 14:13:14', 1),
       ('不错,还挺有意思。', '2010-01-01 15:13:14', 1),
       ('不错,还挺有意思。', '2010-01-01 16:13:14', 1),
       ('不错,还挺有意思。', '2010-01-01 17:13:14', 2),
       ('不错,还挺有意思。', '2010-01-01 18:13:14', 2),
       ('不错,还挺有意思。', '2010-01-01 19:13:14', 2),
       ('感谢分享，祝楼主早日脱单', '2010-01-01 20:13:14', 2),
       ('感谢分享，祝楼主早日脱单', '2010-01-01 22:13:14', 2),
       ('感谢分享，祝楼主早日脱单', '2010-02-01 01:13:14', 3),
       ('感谢分享，祝楼主早日脱单', '2010-02-01 02:13:14', 3),
       ('感谢分享，祝楼主早日脱单', '2010-02-01 03:13:14', 5),
       ('感谢分享，祝楼主早日脱单', '2010-02-01 10:13:14', 5),
       ('感谢分享，祝楼主早日脱单', '2010-02-01 12:13:14', 5),
       ('感谢分享，祝楼主早日脱单', '2010-02-01 13:13:14', 6),
       ('感谢分享，祝楼主早日脱单', '2010-02-01 14:13:14', 6),
       ('感谢分享，祝楼主早日脱单', '2021-01-01 12:12:12', 6),
       ('ds地耨某！90在塔顶fffasdfasdflkjasdllkdfoiasdflkfaojflasdflkasdfkjasdkfasdf☻ẋ☺',
        '2021-02-02 02:02:02', 7),
       -- 违规内容
       ('猜十二生肖?(奔逸绝尘打一个生肖)(一句真言:奔逸绝尘)猜什么动物?<p><p>###040+#加·威·∨·信：【 W855～329 】 为您解--答',
        '2021-03-03 20:20:20', 8),
       ('垃圾玩意，发的什么东西，给爷爬', '2021-03-03 21:20:20', 8),
       ('你也滚蛋！跟你很熟吗？起个这ID来恶心人？', '2021-03-03 21:20:20', 8),
       ('欢迎你给舔，但是要口活好，搞不舒服我的女人，一脚踹床寸滚犊子。',
        '2021-03-03 20:20:20', 8),
       ('☞cherry.然然♛☜ 你被移出了群@☞cherry.然然♛☜ 骗你的😁😁😁😁 ',
        '2021-03-03 20:20:20', 8),
       ('你是不是练法轮功的', '2021-03-03 20:20:20', 8),
       ('几个点提一下，咨询.1.4.7～0.0.0.6～6.3.7.2。1.【配套齐全】 共享城东大配套，周边4大综合体齐聚:
中骏世界城、星光耀广场、华大泰禾广场、润柏 香港城;',
        '2021-03-03 20:20:20', 8);
